In [62]:
## All Imports

from IPython.display import HTML
import numpy as np
#import urllib2
import bs4  #Beautiful Soup
import time
import operator
import socket
#import cPickle
import re

from pandas import Series
import pandas as pd
from pandas import DataFrame

import matplotlib
import matplotlib.pyplot as plt
%matplotlib inline

#import seaborn as sns
#sns.set_context("talk")
#sns.set_style("white")

#from secret import *

In [63]:
#Might need API Registrations for Rotten Tomatoes, Twitter
#Rotten tomatoes have stopped registration
#Will register as examples require it

In [64]:
#Reading data from Movielens under group lens

#Reading users data

# pass the column names for each column in the csv
u_cols = ["user_id","age","sex","occupation","zip_code"]

#Read the u.user file from group lens database
users = pd.read_csv(
    'http://files.grouplens.org/datasets/movielens/ml-100k/u.user',
    sep = '|', names = u_cols)

#top 5 rows from users table
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [65]:
#Read the Ratings data

#names for the columns for the table
r_cols = ["user_id", "movie_id","rating","unix_timestamp"]

#read the rating files; note that the seperator is tab for this file
ratings = pd.read_csv(
    "http://files.grouplens.org/datasets/movielens/ml-100k/u.data",
    sep ="\t", names = r_cols)

#print the first 5 ratings
ratings.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

In [66]:
#Data about the movies

#The movies file contains more than 5 columns, but we are only considering
# the first five columns

#Naming the first five columns
m_cols =["movie_id","title","release_date","video_release_date","imdb_url"]

movies = pd.read_csv(
    "http://files.grouplens.org/datasets/movielens/ml-100k/u.item",
    sep = "|", names = m_cols, usecols = range(5)) #usecols considers columns
                                                #specified
#print the first 5 movies
movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

In [67]:
#Getting some information about the data
print(movies.dtypes) #Gives information about the content of each column
                     # as interpreted by python
print()
print(movies.describe()) #.describe find the columns that are numerical
                        # (and not objects or complex) and provides general
                        # statistics about it.
#Note the only columns that are chose are movie_id = int64 and video_release
#_date that is float 64

movie_id                int64
title                  object
release_date           object
video_release_date    float64
imdb_url               object
dtype: object

          movie_id  video_release_date
count  1682.000000                 0.0
mean    841.500000                 NaN
std     485.695893                 NaN
min       1.000000                 NaN
25%     421.250000                 NaN
50%     841.500000                 NaN
75%    1261.750000                 NaN
max    1682.000000                 NaN

In [68]:
#Selecting specific data from a set

print("User table data\n", users.head(),"\n") #Just to see what data is in users

print("Data about User's occupation")
print(users["occupation"].head()) #just first five occupation
print()
#print specific columns
modtable = users[["occupation","sex"]] #note enty insider users is a list

print("\nUser's occupation and Sex")
print(modtable.head()) #new table that contains just user's sex and occ

print()
newcol = ["occupation","sex"] #you can assign the names to a new var
modtable2 = users[newcol] #and get use that var to get data from dataframe
print("Another way to get user's sex and occupation")
print(modtable2.head())

User table data
    user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

Data about User's occupation
0    technician
1         other
2        writer
3    technician
4         other
Name: occupation, dtype: object


User's occupation and Sex
   occupation sex
0  technician   M
1       other   F
2      writer   M
3  technician   M
4       other   F

Another way to get user's sex and occupation
   occupation sex
0  technician   M
1       other   F
2      writer   M
3  technician   M
4       other   F

In [69]:
#Filtering data

#select data for users older than 25
above25 = users["age"]>25 #Gives a true/false 
print("Result of filtering")
print(above25.head(),"\n")

print("Apply the filtering")
print(users[above25].head()) 
print()
#Another way
print(users[users.age>25].head())
print()
users[users.age>25].head() #Not sure if the output format difference
                            # are worth looking, but fyi

Result of filtering
0    False
1     True
2    False
3    False
4     True
Name: age, dtype: bool

Apply the filtering
   user_id  age sex     occupation zip_code
1        2   53   F          other    94043
4        5   33   F          other    15213
5        6   42   M      executive    98101
6        7   57   M  administrator    91344
7        8   36   M  administrator    05201

   user_id  age sex     occupation zip_code
1        2   53   F          other    94043
4        5   33   F          other    15213
5        6   42   M      executive    98101
6        7   57   M  administrator    91344
7        8   36   M  administrator    05201

   user_id  age sex     occupation zip_code
1        2   53   F          other    94043
4        5   33   F          other    15213
5        6   42   M      executive    98101
6        7   57   M  administrator    91344
7        8   36   M  administrator    05201

In [70]:
#Find users above 40 and are male
users.dtypes
users[(users.age>40) & (users.sex=="M")].head()

    user_id  age sex     occupation zip_code
5         6   42   M      executive    98101
6         7   57   M  administrator    91344
9        10   53   M         lawyer    90703
12       13   47   M       educator    29206
13       14   45   M      scientist    55106

In [71]:
#show the mean age for women programmers
selected_users = users[(users.sex == "F") & (users.occupation =="programmer")]
print(selected_users.describe(),"\n")

# one more way
print("One more way for mean", selected_users.age.mean())
#describe gives stat for every numerical columns
print(users[(users["sex"]=="F") & (users["occupation"]=="programmer")].mean())
print()
print(users[(users.sex=="F") & (users.occupation=="programmer")].mean())

          user_id        age
count    6.000000   6.000000
mean   411.166667  32.166667
std    149.987222   5.115336
min    292.000000  26.000000
25%    313.000000  28.250000
50%    378.000000  32.000000
75%    416.750000  36.500000
max    698.000000  38.000000

One more way for mean 32.166666666666664
user_id    411.166667
age         32.166667
dtype: float64

user_id    411.166667
age         32.166667
dtype: float64

In [72]:
#Split and combine:
# Splitting the groups into data based on criteria
# applying a common function to each group independently
# combining the data


#Find the users who provided a lot of ratings:

#Method:
    # Split data per user ID
    # Count the ratings
    # combine the result

In [73]:
print(ratings.head())
#Look at the data; i

grouped_data = ratings.groupby("user_id") #Splitting the data on userid
                                        #Accumulating the data per user
ratings_per_user= grouped_data.count() #Apply the count function, ratings per user
print(ratings_per_user.head())
#Because we split the entire data frame by user id we get the coutns for
#movie ids, ratings and unix-timestamps

#lets sort to find the top 10 user ids who have given most rating
ratings_per_user.sort_values(by = "rating", ascending = False).head(10)
#sort_values method; needs "by = "<which column>" and sort order

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596
         movie_id  rating  unix_timestamp
user_id
1             272     272             272
2              62      62              62
3              54      54              54
4              24      24              24
5             175     175             175

         movie_id  rating  unix_timestamp
user_id
405           737     737             737
655           685     685             685
13            636     636             636
450           540     540             540
276           518     518             518
416           493     493             493
537           490     490             490
303           484     484             484
234           480     480             480
393           448     448             448

In [79]:
#Another version is if we just want movie ids being counted
col_names =["user id","total ratings"]

print(ratings["movie_id"].head(),"\n") #just gives index and movie id
print(ratings["user_id"].head()) #just gives user index and user ids

group_user_rating = ratings["movie_id"].groupby(ratings["user_id"])
#ratings["movie_id"] == just get the movie ids
# .groupby(rating["user_id" ]) == group the movie ids by the user_id

#Note: group_user_rating is not a dataframe; it is a SeriesGroupby object
print("Object type = ", type(group_user_rating)) # It is kind of a 
        #dictionary where indices are user_ids and values are movie id
  
rating_per_user = group_user_rating.count()
print("Object type", type(rating_per_user)) #Series object
print("\nRating per user ", rating_per_user.head())  #index = user id and values are counts of movies
                    #rated
    
print("Sorted list of # of ratings per user")
rating_per_user.sort_values(ascending = False).head()

0    242
1    302
2    377
3     51
4    346
Name: movie_id, dtype: int64

0    196
1    186
2     22
3    244
4    166
Name: user_id, dtype: int64
Object type =  <class 'pandas.core.groupby.SeriesGroupBy'>
Object type <class 'pandas.core.series.Series'>

Rating per user  user_id
1    272
2     62
3     54
4     24
5    175
dtype: int64

user_id
405    737
655    685
13     636
450    540
276    518
dtype: int64

In [75]:
#Get the average rating per movie
group_movie_rating = ratings.groupby(ratings["movie_id"])
mean_movie_rating = group_movie_rating.mean()
print(mean_movie_rating.head())

#Find the maximum movie rating
maximum_rating = mean_movie_rating["rating"].max()
good_movie = mean_movie_rating[mean_movie_rating.rating == maximum_rating]
print("\nType of 'Good Movie' object", type(good_movie))
        #good_movie is a DataFrame object
print()

good_movie_ids = good_movie.index #Note we had to use index to get the movie id
print(good_movie_ids)
good_movie_name = movies[movies.movie_id.isin(good_movie_ids)].title #Note he
                            # isin call; setting movie.movie_id==good_movie_ids
                            # does not work
good_movie_name

             user_id    rating  unix_timestamp
movie_id
1         477.011062  3.878319    8.828054e+08
2         492.007634  3.206107    8.834174e+08
3         459.133333  3.033333    8.822269e+08
4         469.497608  3.550239    8.827175e+08
5         439.372093  3.302326    8.825882e+08

Type of 'Good Movie' object <class 'pandas.core.frame.DataFrame'>

Int64Index([814, 1122, 1189, 1201, 1293, 1467, 1500, 1536, 1599, 1653], dtype='int64', name='movie_id')

813                         Great Day in Harlem, A (1994)
1121                       They Made Me a Criminal (1939)
1188                                   Prefontaine (1997)
1200           Marlene Dietrich: Shadow and Light (1996)
1292                                      Star Kid (1997)
1466                 Saint of Fort Washington, The (1993)
1499                            Santa with Muscles (1996)
1535                                 Aiqing wansui (1994)
1598                        Someone Else's America (1995)
1652    Entertaining Angels: The Dorothy Day Story (1996)
Name: title, dtype: object

In [80]:
#Another way: Get average rating per movie
group_movie_rating = ratings["rating"].groupby(ratings["movie_id"])
    #Create at a table with ratings grouped by movie_id
    
avg_movie_rating = group_movie_rating.mean() #Calculate the mean for each movie_id
maximum_rating = max(avg_movie_rating)
print("Average movie rating\n", avg_movie_rating.head())

movieid_maxrating = avg_movie_rating[avg_movie_rating == maximum_rating].index
                #Note that in this scenario,could not use
                #avg_movie_rating.rating, but had to use avg_movie_rating
                #as the column name
            
                #Had to use .index just to get a list of movie ides
                            
good_movie_names = movies[movies.movie_id.isin(movieid_maxrating)].title
print(good_movie_names)

Average movie rating
 movie_id
1    3.878319
2    3.206107
3    3.033333
4    3.550239
5    3.302326
Name: rating, dtype: float64
813                         Great Day in Harlem, A (1994)
1121                       They Made Me a Criminal (1939)
1188                                   Prefontaine (1997)
1200           Marlene Dietrich: Shadow and Light (1996)
1292                                      Star Kid (1997)
1466                 Saint of Fort Washington, The (1993)
1499                            Santa with Muscles (1996)
1535                                 Aiqing wansui (1994)
1598                        Someone Else's America (1995)
1652    Entertaining Angels: The Dorothy Day Story (1996)
Name: title, dtype: object

In [100]:
#The movies with high rating are unknown. How many ratings did they recieve?

listrating = ratings[ratings.movie_id.isin(movieid_maxrating)]
print("Movie IDs and Ratings for movies with max avg rating\n")
print(listrating.head(20))

count5rating = listrating["rating"].groupby(listrating["movie_id"])
#Here we find a list of ratings grouped by their movie_ids

#As discovered earlier the groupby object is like a dictionary
#In the group by object, we have the movie_id as the index of the 
# dictionary and the index of movies in the original rating database
# as the values of the dictionary
print()
print(count5rating.groups)
#E.g here it shows 1189 = movie id and 4545, 62150 and 65288 as the
#values of indices for original dataset that gave 5 rating.

#Now just count the number of ratings.
count5rating.count()

Movie IDs and Ratings for movies with max avg rating

       user_id  movie_id  rating  unix_timestamp
4545        87      1189       5       879877951
6126       279      1500       5       875306613
6519        13       814       5       886302261
12314      385      1536       5       879441339
23044      489      1293       5       891446623
43688      437      1599       5       880142614
45350      519      1293       5       883250148
47866      675      1653       5       889489913
49046      146      1293       5       891458080
62150      416      1189       5       893213917
62282      244      1467       5       880605553
65288      532      1189       5       892521554
77635       60      1122       5       883326498
78008       90      1201       5       891383687
95364      781      1500       5       879634096
97057      886      1467       5       876033987

{1536: [12314], 1201: [78008], 1653: [47866], 1189: [4545, 62150, 65288], 1122: [77635], 1467: [62282, 97057], 1500: [6126, 95364], 1293: [23044, 45350, 49046], 814: [6519], 1599: [43688]}

movie_id
814     1
1122    1
1189    3
1201    1
1293    3
1467    2
1500    2
1536    1
1599    1
1653    1
dtype: int64

In [130]:
#Excercise: Try to get list of movies that have more than 100 rating
#and have highest average rating
print(users.head())
print(movies.head())
print(ratings.head())

#Movies with greater than 100 ratings
ratings_per_movie = ratings["rating"].groupby(ratings["movie_id"])
ratings_greater100 = ratings_per_movie.count()>100
#NEED TO THINK

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213
   movie_id              title release_date  video_release_date  \
0         1   Toy Story (1995)  01-Jan-1995                 NaN
1         2   GoldenEye (1995)  01-Jan-1995                 NaN
2         3  Four Rooms (1995)  01-Jan-1995                 NaN
3         4  Get Shorty (1995)  01-Jan-1995                 NaN
4         5     Copycat (1995)  01-Jan-1995                 NaN

                                            imdb_url
0  http://us.imdb.com/M/title-exact?Toy%20Story%2...
1  http://us.imdb.com/M/title-exact?GoldenEye%20(...
2  http://us.imdb.com/M/title-exact?Four%20Rooms%...
3  http://us.imdb.com/M/title-exact?Get%20Shorty%...
4  http://us.imdb.com/M/title-exact?Copycat%20(1995)
   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

array([ True,  True, False, ..., False, False, False], dtype=bool)

In [91]:
#Passing a function
average_ratings = group_movie_rating.apply(lambda f: f.mean())
average_ratings.head()

movie_id
1    3.878319
2    3.206107
3    3.033333
4    3.550239
5    3.302326
dtype: float64

In [ ]:
#Quiz:
#Get the average rating per user
# Advance: List all occupation and if they are male or female dominant